const hosting = require(`../server/hosting`);
const documenting = require(`../server/documenting`);


const h = hosting;
const s = documenting.shortcuts;
const {
    document,
    section,
    paragraph,
    list,
    sentence,
    emphasis,
    figurative,
    link,
    note,
    illustration,
    js,
    kw,
    v,
    f,
    c,
    p,
    lt,
    cm,
    code,
} = s;


exports = module.exports = new h.DocumentResource({
    Document : document([ `Як впихнути Bullet Physics. `, `В браузер.`, `Через TypeScript. `, `З використанням npm.` ], {},
        section(`Про що взагалі йде мова?`, ...[
            paragraph(...[
                sentence(`Деколи хочеться намалювати в браузері гарну інтерактивну сцену з реалістичною тривимірною фізикою. `),
                sentence(`Також, при цьому деколи хочеться писати код на TypeScript. `),
                sentence(`Ще рідше виникає потреба разом з цим використовувати npm для управління пакетами. `),
                sentence(`Ну і на десерт, деколи виникає потреба в симуляції м'яких тіл або нестандартної геометрії, які не завжди мають підтримку у рушіях фізики, принаймні для JavaScript. `),
            ]),
            paragraph(...[
                sentence(`У цій маленькій статті я розповім що робити, якщо всі ці "хочу" раптом перетнулись. `),
                sentence(`Ми створимо невелику демонстраційну сцену з Bullet Physics у ролі фізичного рушія та three.js у ролі графічного. `),
                sentence(`Також ми будемо використовувати TypeScript для написання коду замість JavaScript та npm у ролі пакетного менеджера. `),
                sentence(`В решті-решт, весь написаний код буде запакований за допомогою browserify та використаний в простій html сторінці. `),
                sentence(`Сама ж сторінка буде надаватись простим express сервером на безплатному хостингу Heroku. `),
            ]),
        ]),
        section(`Репозиторій на GitHub.`, ...[
            paragraph(...[
                sentence(`Якщо ми хочемо мати можливість поділитись результатом нашої праці через інтернет - необхідно розмістити нашу сторінку на загальнодоступному сервері. `),
                sentence(`З іншого боку, якщо в майбутньому нам захочеться модифікувати сцену, експериментувати з нею та при цьому зберігати її проміжні версії - було б добре тримати наш код в git репозиторії. `),
                sentence(`Ми почнемо з того, що заведемо порожній репозиторій на github та клонуємо його в локальний каталог на нашому комп'ютері. `),
                sentence(`Коли ми закінчимо роботу, то саме з цього репозиторію можна буде підняти сайт на Heroku. `),
            ]),
            paragraph(...[
                sentence(`Важливо, що у цій статті ми не будемо розглядати нюанси роботи в git. `),
                sentence(`З іншого боку, робота з Heroku не потребує якихось особливих навичок окрім вміння pushати файли на github. `),
                sentence(`Для подальшої ж роботи Heroku достатньо мати git репозиторій з необхідними файлами, а решту він зробить за нас. `),
            ]),
        ]),
        section(`Налаштовуємо npm.`, ...[
            paragraph(...[
                sentence(`Аби не збирати вручну всі пакети, потрібні для роботи серверу та сторінки, ми будемо використовувати npm. `),
                sentence(`І почнемо ми з того, що створимо package.json необхідний для його роботи. `),
                sentence(`Також для цього потрібно встановити Node.js, якщо його у вас немає. `),
            ]),
            paragraph(...[
                sentence(`Отож, після того як git репозиторій створено та клоновано, необхідно відкрити його кореневий каталог в середовищі розробки (наприклад, Visual Studio Code) або терміналі. `),
                sentence(`Далі ми створимо package.json набравши в консолі npm init -y:`),
            ]),
            illustration(``, code(`json`, ...[
                [ `{` ],
                [ `  "name": "demo",` ],
                [ `  "version": "1.0.0",` ],
                [ `  "description": "",` ],
                [ `  "main": "index.js",` ],
                [ `  "scripts": {` ],
                [ `    "test": "echo \\"Error: no test specified\\" && exit 1"` ],
                [ `  },` ],
                [ `  "keywords": [],` ],
                [ `  "author": "",` ],
                [ `  "license": "ISC"` ],
                [ `}` ],
            ])),
            paragraph(...[
                sentence(`Файл package.json буде слугувати базою даних для залежностей, які ми використовуємо в нашому проекті. `),
                sentence(`Зокрема, це будуть необхідні нам пакети з npm, а також сценарії для збірки проекту, стартування сервера та іншого. `),
                sentence(``),
            ]),
            paragraph(...[
                sentence(``),
                sentence(``),
                sentence(``),
            ]),
        ]),
    ),
});
