const hosting = require(`../server/hosting`);
const documenting = require(`../server/documenting`);


const h = hosting;
const s = documenting.shortcuts;
const {
    document,
    section,
    paragraph,
    link,
    list,
    sentence,
    note,
} = s;

exports = module.exports = new h.DocumentResource({
    Document : document([sentence(`Програмування комп'ютерної графіки. `), sentence(`Завдання, підходи та інструменти.`) ], {},
        section(`Що це за курс?`, ...[
            paragraph(...[
                sentence(`Цей курс присвячений вивченню сучасної комп'ютерної графіки та її програмуванню. `),
                sentence(`Основна його мета - дати вичерпне розуміння основних принципів та підходів, що використовуються в цій області. `),
                sentence(`Курс наповнений як теоретичними відомостями, так і прикладами програм, що демонструють використання цих знань на практиці.`),
            ]),
        ]),
        section(`Що таке комп'ютерна графіка?`, ...[
            paragraph(...[
                sentence(`Комп'ютерна графіка займається створенням зображень з використанням комп'ютерів. `),
                sentence(`Її можна виділити в окрему область знань і на це є вагомі причини. `),
                sentence(`Робота з зображеннями та, особливо, їх побудова, сильно відрізняються від інших завдань, що зустрічаються в світі програмування. `),
                sentence(`У цих завдань свої власні критерії для оцінки успіху, а тому для їх вирішення часто використовують особливі підходи, алгоритми та навіть апаратне забезпечення. `),
            ]),
        ]),
    ),
});
