const hosting = require(`../server/hosting`);
const documenting = require(`../server/documenting`);


const h = hosting;
const s = documenting.shortcuts;
const {
    document,
    section,
    paragraph,
    link,
    list,
    sentence,
    note,
} = s;

exports = module.exports = new h.DocumentResource({
    Document : document([sentence(`Програмування комп'ютерної графіки. `), sentence(`Завдання, підходи та інструменти.`) ], {},
        section(`Що це за курс?`, ...[
            paragraph(...[
                sentence(`Цей курс присвячений вивченню сучасної комп'ютерної графіки та її програмуванню. `),
                sentence(`Основна його мета - дати вичерпне розуміння основних принципів та підходів, що використовуються в цій області. `),
                sentence(`Курс наповнений як теоретичними відомостями, так і прикладами програм, що демонструють використання цих знань на практиці.`),
            ]),
        ]),
        section(`Що таке комп'ютерна графіка?`, ...[
            paragraph(...[
                sentence(`Комп'ютерна графіка займається створенням зображень з використанням комп'ютерів. `),
                sentence(`Її можна виділити в окрему область знань і на це є вагомі причини. `),
                sentence(`Робота з зображеннями та, особливо, їх побудова, сильно відрізняються від інших завдань, що зустрічаються в світі програмування. `),
                sentence(`У цих завдань свої власні критерії для оцінки успіху, а тому для їх вирішення часто використовують особливі підходи, алгоритми та навіть апаратне забезпечення. `),
            ]),
            paragraph(...[
                sentence(`Одна з ключових особливостей комп'ютерної графіки - це обробка великої кількості однотипних об'єктів. `),
                sentence(`Основними такими об'єктами є вершини, з яких складаються зображувані фігури та пікселі, з яких складаються екрани моніторів. `),
                sentence(`Якщо мова йде про графіку реального часу, наприклад, в іграх, то з'являється ще одна серйозна особливість - швидкість побудови зображення. `),
                sentence(`Також є й інші чинники, такі як вимоги до якості та реалістичності зображення або обмеження використання пам'яті. `),
                sentence(`Все це сильно відрізняє роботу з графікою від, наприклад, роботи з базою даних, мережевим сервером чи розпізнаванням мови. `),
            ]),
        ]),
    ),
});
