const hosting = require(`../server/hosting`);
const documenting = require(`../server/documenting`);


const h = hosting;
const s = documenting.shortcuts;
const {
    document,
    section,
    paragraph,
    // list,
    sentence,
    // emphasis,
    // figurative,
    // link,
    note,
    // illustration,
    // js,
    // kw,
    // v,
    // f,
    // c,
    // p,
    // lt,
    // cm,
} = s;


exports = module.exports = new h.DocumentResource({
    Document : document([sentence(`Програмування комп'ютерної графіки. `), sentence(`Вступ.`) ], {},
        section(`Завдання та підходи.`, ...[
            paragraph(...[
                sentence(`Сьогодні комп'ютерну графіку можна розглядати як окрему область знань і на це є вагомі причини. `),
                sentence(`Завдання, які стоять перед розробниками цієї сфери дуже специфічні і вимагають особливих підходів для свого вирішення. `),
                sentence(`Нюанси цієї роботи можна умовно розділити на чотири категорії: багато, швидко, одноманітно та ілюзорно. `),
                sentence(`Зараз поясню. `),
            ]),
            paragraph(...[
                sentence(`Почнемо з кількості. `),
                sentence(`Основними різновидами примітивів з якими сьогодні працює графіка є вершини та пікселі. `),
                sentence(`З вершин складаються об'єкти, що виводяться на екран, а той, в свою чергу, складається з пікселів. `),
                sentence(`В тій чи іншій мірі кожну вершину потрібно обробити, а для коженого пікселя встановити потрібний колір. `),
                sentence(`І кількість цих вершин та пікселів - величезна! `),
            ]),
            paragraph(...[
                sentence(`Навіть старі за сучасними мірками монітори з роздільною здатністю 320х240 усього мали 76 800 пікселів. `),
                sentence(`Відносно стандартні сьогодні FullHD монітори мають роздільну здатність 1920х1080, а це вже 2 073 600 пікселів! `),
                sentence(`Але й не це межа, тому що їх поступово витісняють формати QHD (2560x1440), 4K UHD (3840x2160) та 8K UHD (7680х4320)`, note([ `Як, не дивно, це в першу чергу помітно на ринку мобільних пристроїв та телевізійної техніки. `, `Велика кількість флагманських смартфонів має роздільну здатність QHD або вище, а 4K телевізори поступово стають новим стандартом на ринку.` ]), `. `),
                sentence(`Монітори з такими форматами складаються з 3 686 400, 8 294 400 та 33 177 600 пікселів відповідно! `),
                sentence(`І для кожного пікселя на кожному кадрі потрібно розрахувати відповідний йому колір. `),
            ]),
            paragraph(...[
                sentence(`Вершини - така ж болюча тема як і пікселі, якщо говорити про їх кількість. `),
                sentence(`Моделі, що використовуються в комп'ютерній графіці сьогодні, містять десятки-сотні тисяч вершин, а подекуди мільйони і навіть мільярди`, note([ `Важливо підкреслити те, що в залежності від напрямку і потреб це число може суттєво змінюватись. `, `Об'єкти переднього плану в іграх можуть мати мільйони вершин, а дрібні, ледь помітні деталі - сотні вершин, або взалагі виводитись спеціальними техніками що їх не потребуюють. `, `У той же час моделі, що використовуються в кінематографі, можуть займати на дисках цілі терабайти. ` ]), `. `),
                sentence(`Самих моделей на екрані теж може бути безліч: тисячі і десятки тисяч. `),
                sentence(`І кожну вершину кожної моделі теж потрібно правильно обробити на кожному кадрі. `),
            ]),
            paragraph(...[
                sentence(`Друга важлива особливість - це швидкість. `),
                sentence(`Монітори оновлюють зображення на екрані десятки і сотні разів в секунду. `),
                sentence(`Нижня межа сьогодні - це 30 FPS (Frames Per Second - кадрів у секунду), або 30 Гц `, note([ `З цим також пов'язаний міф про те, що людське око не здатне вловлювати більше ніж 24 кадри за секунду. `, `Це далеко не так. ` ]), `. `),
                sentence(`Але вона дуже погано ілюструє справжню ситуацію на ринку, адже охоплює лише старі телевізори та ігрові консолі які й виводили на них зображення. `),
                sentence(`Також, потребу у високій частоті оновлення може поставити під сумнів той факт, що деякі сучасні браузери не здатні забезпечити плавну прокрутку на деяких сайтах, але це вже тема іншої розмови... `),
            ]),
            paragraph(...[
                sentence(`Сьогодні умовним стандартом (і то у певній мірі застарілим) можна вважати частоту оновлення екрану в 60 Гц. `),
                sentence(`Але для багатьох динамічних ігор, таких як стрілялки, гонки або боротьба - цього може бути катастрофічно мало. `),
                sentence(`Такі жанри часто вимагають частоту близьку до 100-120 Гц і навіть особливі пристрої вводу `, note([ `Наприклад, ігрові миші з високою точністю і зменшеною затримкою реакції, або клавіатури що підтримують одночасне зчитування великої кількості клавіш. ` ]), ` які здатні забезпечити достатньо швидку реакцію. `),
                sentence(`Але сьогоднішні ігрові монітори йдуть ще далі, пропонуючи частоту 144 Гц, 240 Гц та шалені 360 Гц. `),
                sentence(`Можна лише уявити собі комп'ютерну графіку майбутнього, де стандартом є 8К монітор з частотою 360 Гц. `),
                sentence(`А це, увага, заповнення кольором 11 943 936 000 пікселів в секунду! `),
                sentence(`12 мільярдів, Карл! `),
            ]),
            paragraph(...[
                sentence(`Але не все так погано. `),
                sentence(`Це були дві не надто приємні особливості, які погіршують нам життя, але є й хороші. `),
                sentence(`По-перше, на щастя для нас, алгоритми для розрахунку кольору пікселя та перетворення вершин об'єкта не сильно відрізняються для різних пікселів та вершин. `),
                sentence(`Іншими словами, в більшості випадків переважна більшість вершин чи пікселів обробляються одним і тим же алгоритмом. `),
                sentence(`Часто, навіть кількість кроків алгоритму для різних пікселів збігається, відрізняються лише вхідні дані. `),
                sentence(`Ще доволі часто ці алгоритми або не вимагають для обробки одного пікселя чи вершини інформацію про їх сусідів, або потребують її в дуже обмеженій мірі. `),
                sentence(`Така особливість - коли колір одного пікселя не залежить від кольору іншого - дозволяє зробити їх обробку паралельною. `),
            ]),
            paragraph(...[
                sentence(`Друга хороша новина пов'язана з тим, що в переважній більшості випадків споживачами кінцевого продукту є звичайні люди. `),
                sentence(`Можливості людей, а особливо їх увага, дуже обмежені. `),
                sentence(`Якщо відтінок кольору чи розташування об'єкта на екрані будуть відрізнятись від "правильних" не надто сильно, ніхто цього не помітить. `),
                sentence(`Навіть якщо тінь від персонажа на землі не буде повторювати його контури досконало, або навіть просто буде розмитою плямою - зображення в цілому може виглядати досить прийнятно. `),
                sentence(`Навіть якщо розсіяне світло на об'єктах буде розраховане за спрощеною формулою або в зниженій точності - всім буде байдуже, адже більшість навіть не знає терміну розсіяне світло. `),
                sentence(`Такі занижені вимоги до процесу обчислення суттєво спрощують роботу, адже дозволяють використовувати простіші з точки зору продуктивності алгоритми. `),
            ]),
            paragraph(...[
                sentence(`Отже, підсумуємо. `),
                sentence(`Програмування комп'ютерної графіки пов'язане з обробкою великої кількості об'єктів багато разів за секунду. `),
                sentence(`На щастя, часто ці обчислення є дуже однотипними, легко розпаралелюються та не вимагають високої точності. `),
                sentence(`Такі особливості призвели до того, що сьогодні для роботи з графікою використовують спеціалізоване обладняння - графічні прискорювачі. `),
                sentence(`Або, по-простому, відеокарти. `),
            ]),
        ]),
        section(``, ...[
            paragraph(...[
                sentence(``),
            ]),
        ]),
    ),
});
