const hosting = require(`../server/hosting`);
const documenting = require(`../server/documenting`);

/**
 * Звідси можна натягати зображень: https://en.wikipedia.org/wiki/Pixel
 */

const h = hosting;
const s = documenting.shortcuts;
const {
    document,
    section,
    paragraph,
    sentence,
    note,
    illustration,
} = s;

const resolutions = illustration(`Порівняння роздільних здатностей, популярних сьогодні, в минулому та в найближчому майбутньому.`,
    new documenting.ImageIllustrationContent({ Url : `/media/cg-1/resolutions.svg` }),
);

exports = module.exports = new h.DocumentResource({
    Document : document([sentence(`Програмування комп'ютерної графіки. `), sentence(`Завдання, підходи та інструменти.`) ], {},
        section(``, ...[
            paragraph(...[
                sentence(`Основним завдання комп'ютерної графіки є побудова зображень з використанням обчислювальної техніки, зокрема, комп'ютерів. `),
                sentence(`Сьогодні це досить виокремлена область а спеціалісти які в ній працюють повинні володіти досить специфічними знаннями та навичками, не характерними для інших галузей ІТ. `),
                sentence(`В основному це пов'язано з тим, що робота з графікою часто передбачає роботу з фізикою, зокрема, оптикою, а також роботу з графічними прискорювачами. `),
                sentence(`Ну і окрім цього розробнику також доводиться мати справу і з тими прикладними областями, де безпосередньо використовується графіка - фото, мультиплікація, ігри, - які самі по собі мають безліч нюансів. `),
            ]),
        ]),
        section(`Графічні прискорювачі.`, ...[
            paragraph(...[
                sentence(`Пов'язані з графікою обчислення проводяться не на центральних процесорах а на графічних прискорювачах. `),
                sentence(`На це є дві вагомі причини: обсяг даних які необхідно обробити та швидкість цієї обробки. `),
            ]),
            paragraph(...[
                sentence(`Для прикладу можна розглянути все ще популярну сьогодні роздільна здатність 1080р. `),
                sentence(`Її розміри - 1920х1080 - передбачають майже 2 мільйони окремих пікселів. `),
                sentence(`Ще один вагомий нюанс - це частота оновлення екрану, яка зазвичай становить щонайменше 60Гц для моніторів або 30Гц для телевізорів. `),
                sentence(`Це означає, що лише для оновлення картинки на екрані необхідно щосекунди проводити 120 мільйонів операцій, а саме оновлення повинно тривати не довше ніж 17 мілісекунд. `),
            ]),
            paragraph(...[
                sentence(`Окрім пікселів на екрані є й інші вузькі місця. `),
                sentence(`Зокрема, це вершини з яких складається зображувана геометрія і текстури які на неї накладаються. `),
                sentence(`Сьогодні кількість вершин що потрапляють в кадр може досягати кількох мільйонів. `),
                sentence(`Кожну таку вершину потрібно обробити, а примітиви сформовані з наборів вершин - перетворити в пікселі. `),
                sentence(`В межах цього ж кадру різна геометрія може використовувати різні текстури, а їх загальна кількість може коливатись від десятків до сотень. `),
                sentence(`Якщо розглядати роздільну здатність 1024х1024 і глибину кольору в 24 біти/піксель як стандартні, то декілька десятків текстур займатимуть 100 Мб оперативної пам'яті. `),
                sentence(`Може здаватись що це небагато, але потрібно пам'ятати що до значної частини цих текстур йде звернення на кожному кадрі і окрім забезпечення швидкого обчислення потрібно забезпечити ще й швидке звернення до даних. `),
            ]),
            paragraph(...[
                sentence(`Сьогодні центральні процесори достатньо потужні для того щоб забезпечити достатню продуктивність при роботі з простою графікою. `),
                sentence(``),
                sentence(``),
            ]),
        ]),
        section(``, ...[
            paragraph(...[
                sentence(``),
                sentence(``),
                sentence(``),
            ]),
            paragraph(...[
                sentence(``),
                sentence(``),
                sentence(``),
            ]),
        ]),
    ),
});
