const hosting = require(`../server/hosting`);
const documenting = require(`../server/documenting`);


const h = hosting;
const s = documenting.shortcuts;
const {
    document,
    section,
    paragraph,
    link,
    list,
    sentence,
    // emphasis,
    // figurative,
    // link,
    // note,
    illustration,
    code,
    // js,
    // kw,
    v,
    f,
    c,
    // p,
    lt,
    // cm,
} = s;

const cpp = (...x) => code(`c++`, ...x);


const mesa = `https://en.wikipedia.org/wiki/Mesa_(computer_graphics)`;
const glh = cpp(lt(`gl.h`));
const glew = cpp(lt(`glew`));
const glfw = cpp(lt(`glfw`));
const GLuint = cpp(c(`GLuint`));
const glCreateBuffers = cpp(f(`glCreateBuffers`));
const glNamedBufferStorage = cpp(f(`glNamedBufferStorage`));


const code_1 = illustration(`Створення буфера для зберігання вершин.`, cpp(...[
    [ c(`GLuint`), ` `, v(`vertices_buffer_handle`), `;` ],
    [ `` ],
    [ f(`glCreateBuffers`), `(`, lt(`1`), `, &`, v(`vertices_buffer_handle`), `);` ],
]));
const code_2 = illustration(``, cpp(...[
    [ `class Vertex` ],
    [ `{` ],
    [ `    float x;` ],
    [ `    float y;` ],
    [ `};` ],
    [ `` ],
    [ `const std::vector<Vertex> vertices =` ],
    [ `{` ],
    [ `    { -0.5f, -0.5f },` ],
    [ `    { +0.5f, -0.5f },` ],
    [ `    { +0.0f, +0.5f },` ],
    [ `};` ],
]));
const image_1 = illustration(`Растеризація векторних фігур.`,
    new documenting.ImageIllustrationContent({ Url : `/media/cg-2/rasterization.svg` }),
);


exports = module.exports = new h.DocumentResource({
    Document : document(
        [
            sentence(`Програмування комп'ютерної графіки. `),
            sentence(`OpenGL/С++. `),
            sentence(`"Привіт, трикутник!".`),
        ],
        { Date : new Date(`2020-06-24`) },
        section(`Що таке OpenGL?`, ...[
            paragraph(...[
                sentence(`OpenGL - це специфікація графічного інтерфейсу. `),
                sentence(`Якщо коротко - це набір структур та функцій, за допомогою яких можна виводити комп'ютерну графіку. `),
                sentence(`Ці функції не залежать від платформи, операційної системи чи мови програмування, а тому можуть бути реалізовані у вигляді драйверів або бібліотек коду. `),
                sentence(`Сьогодні OpenGL доступний для наступних платформ: `),
            ]),
            list(...[
                [
                    sentence(`Операційних систем Windows (включно з Windows 10), Linux та MacOS. `),
                ],
                [
                    sentence(`Відеокарт NVidia, AMD та Intel. `),
                ],
                [
                    sentence(`Доступний у вигляді бібліотек для мов С/С++, Python, C# та інших. `),
                ],
                [
                    sentence(`У якості програмної реалізації в бібліотеці `, link(`Mesa3D`, mesa), `. `),
                ],
            ]),
            paragraph(...[
                sentence(`Також у OpenGL є "дочірні" специфікації, для більшості тих платформ, де немає самого OpenGL. `),
                sentence(`Усі вони в більшій мірі повторюють OpenGL, але все ж вважаються окремими проектами і займають окремі ніші на ринку. `),
                sentence(`Зокрема, це:`),
            ]),
            list(...[
                [
                    sentence(`OpenGL ES. `),
                    sentence(`Використовується на мобільних пристроях та ігрових консолях. `),
                ],
                [
                    sentence(`OpenGL SC. `),
                    sentence(`Використовується на промисловому та медичному обладнанні. `),
                ],
                [
                    sentence(`WebGL. `),
                    sentence(`Використовується в браузерах. `),
                ],
            ]),
            paragraph(...[
                sentence(`Головним героєм цієї серії статей буде реалізація OpenGL для С/С++ та Windows - бібліотека `, glh, `. `),
                sentence(`Також, для спрощення подальшої роботи, ми будемо використовувати бібліотеки `, glew, ` та `, glfw, `. `),
                sentence(`Вони допоможуть нам працювати з контекстом OpenGL (що особливо важливо при роботі з Windows), а також з вікнами та користувацьким вводом. `),
                sentence(`Ми почнемо з найпростішого ознайомчого завдання, класичного для комп'ютерної графіки - виведення на екран трикутника. `),
            ]),
        ]),
        section(`Графічний конвеєр OpenGL.`, ...[
            paragraph(...[
                sentence(`Графічний конвеєр OpenGL в першу чергу призначений для растеризації та виводу геометричних примітивів. `),
                sentence(`Ці геометричні примітиви є точками, лініями або трикутниками, а усі складніші фігури є їх композицією. `),
                sentence(`З трикутників, наприклад, можна зібрати сферу, чайник або навіть цілий ігровий рівень. `),
            ]),
            // можливо тут варто дати приклад того, як з трикутників можна побудувати сферу чи зайця
            paragraph(...[
                sentence(`Процес обробки примітивів у конвеєрі є доволі складним, але ми почнемо зі спрощеної моделі. `),
                sentence(`Кожен примітив задається певною кількістю вершин: однією для точки, парою для лінії та трійкою для трикутника. `),
                sentence(`Ці вершини розміщуються на екрані у відносних - векторних - координатах, які не залежать від його роздільної здатності. `),
                sentence(`Екран, натомість, розбитий на пікселі - окремі квадратні фрагменти, заповнені суцільним кольором. `),
                sentence(`Таку форму - прямокутну сітку розбиту на пікселі - називають растровою. `),
            ]),
            image_1,
            paragraph(...[
                sentence(`Для того, аби відобразити зображення на екрані, потрібно перетворити геометричні фігури з векторної форми в растрову. `),
                sentence(`Цей процес називається растеризацією: під час нього визначається, яким пікселям на екрані відповідають геометричні фігури і який у цих пікселів колір `, image_1, `. `),
                sentence(`Оскільки розміщення об'єктів, їх поворот і масштаб можуть змінюватись - цей процес є необхідним для їх точного відображення. `),
            ]),
        ]),
        section(`Буфери даних.`, ...[
            paragraph(...[
                sentence(`Отож, для того щоб відобразити об'єкт на екрані - спочатку потрібно передати його графічному конвеєру у вигляді примітивів. `),
                sentence(`Найпростішим способом передати дані на GPU є буфер даних. `),
            ]),
            paragraph(...[
                sentence(`Буфери є неперервними та неформатованими масивами даних в пам'яті GPU. `),
                sentence(`Ми можемо створювати та видаляти їх, відводити під них певні обсяги пам'яті, заповнювати їх та читати з них. `),
                sentence(`У буферів є багато призначень, але сьогодні ми будемо використовувати лише для того, щоб зберігати інформацію про наш трикутник. `),
            ]),
            paragraph(...[
                sentence(`Для початку, ми створимо буфер за допомогою функції `, glCreateBuffers, `. `),
                sentence(`У якості аргументів вона приймає кількість буферів які потрібно створити, та вказівник на масив `, GLuint, `, в який буде збережено ідентифікатори буферів. `),
                sentence(`Оскільки нам потрібен лише один буфер - ми просто оголосимо змінну типу `, GLuint, ` і передамо її адресу в функцію `, code_1, `. `),
            ]),
            code_1,
            paragraph(...[
                sentence(`Далі, буфер потрібно заповнити. `),
                sentence(`Для цього, створимо структуру для вершин трикутника і заповнимо ними масив `, code_2, `. `),
                sentence(`За допомогою функції `, glNamedBufferStorage, ` ми передамо дані в буфер, вказавши їх обсяг, джерело, а також властивості даних. `),
                sentence(``),
                sentence(``),
            ]),
            code_2,
            paragraph(...[
                sentence(``),
                sentence(``),
            ]),
        ]),
        section(``, ...[
            paragraph(...[
                sentence(`... тут про вікна ...`),
                sentence(``),
                sentence(``),
            ]),
            paragraph(...[
                sentence(``),
                sentence(``),
                sentence(``),
            ]),
        ]),
        section(``, ...[
            paragraph(...[
                sentence(``),
                sentence(``),
                sentence(``),
            ]),
            paragraph(...[
                sentence(``),
                sentence(``),
                sentence(``),
            ]),
        ]),
    ),
});
