const hosting = require(`../server/hosting`);
const documenting = require(`../server/documenting`);


const h = hosting;
const s = documenting.shortcuts;
const {
    document,
    section,
    paragraph,
    sentence,
    figurative,
    emphasis,
    list,
    link,
    note,
    cpp,
    kw,
    c,
    py,
    lua,
    js,
    cm,
} = s;


exports = module.exports = new h.DocumentResource({
    Document : document([ `Думки вголос. `, `Безпомічні коментарі. ` ],
        {
        },
        section(`Ви часто користуєтесь коментарями? `, ...[
            paragraph(...[
                sentence(`Я - постійно. `),
                sentence(`Я вважаю, що це надзвичайно важлива частина будь якої мови, навіть якщо ця мова не є мовою програмування. `),
                sentence(`Коментування коду настільки ж важливе як і його написання, а брак такої можливості повинен мати під собою вагомі, дуже вагомі підстави. `),
                sentence(`Що більш важливо, коментарі - це не лише спосіб коментування коду, не лише спосіб пояснити його призначення чи як він працює і це далеко не лише `, js(cm(`//`)), ` та `, js(cm(`/**/`)), `. `),
                sentence(`Це інструмент для виходу за межі мови, який при цьому дозволяє однією ногою залишитись в ній. `),
            ]),
            paragraph(...[
                sentence(`Але виглядає так, наче автори більшості популярних мов не зовсім розділяють такі погляди. `),
                sentence(`Мені сумно спостерігати, як сліпе мавпування і бездумна байдужість знецінюють коментарі, адже при достатньому бажанні можна було б стільки усього зробити. `),
                sentence(`В чому справа, спитаєте ви? `),
                sentence(`А я зараз поясню. `),
            ]),
        ]),
        section(``, ...[
            paragraph(...[
                sentence(``),
            ]),
        ]),
    ),
});
