const hosting = require(`../server/hosting`);
const documenting = require(`../server/documenting`);


const h = hosting;
const s = documenting.shortcuts;
const {
    document,
    section,
    paragraph,
    sentence,
    figurative,
    emphasis,
    link,
    lexeme,
    code,
    js,
    cs,
} = s;


const antimatter = `https://uk.wikipedia.org/wiki/%D0%90%D0%BD%D1%82%D0%B8%D0%BC%D0%B0%D1%82%D0%B5%D1%80%D1%96%D1%8F#%D0%A1%D0%B8%D0%BC%D0%B5%D1%82%D1%80%D1%96%D1%8F_%D0%BC%D0%B0%D1%82%D0%B5%D1%80%D1%96%D1%97_%D1%96_%D0%B0%D0%BD%D1%82%D0%B8%D0%BC%D0%B0%D1%82%D0%B5%D1%80%D1%96%D1%97`;


exports = module.exports = new h.DocumentResource({
    Document : document([ `Думки вголос. `, `Порушення симетрії аргументів функції. ` ],
        {
        },
        section(`Асиметрія.`, ...[
            paragraph(...[
                sentence(`У той час як астрономи та фізики ламають голову над `, link(`порушенням симетрії`, antimatter),` між звичайною матерією та антиматерією, мені не дає спокою інший різновид порушення симетрії. `),
                sentence(`Мене непокоїть те, що функції зазвичай приймають багато аргументів, але повертають лише один результат. `),
                // sentence(`І це тупо, я не бачу для цього жодних вагомих підстав. `),
                sentence(`Хоча, здавалося б, немає підстав проводити між ними якусь вагому різницю. `),
                sentence(`Це дуже тупо. `),
                sentence(`Я б навіть сказав, що це один з найпоказовіших прецедентів безпідставних та безглуздих особливостей як в колишніх, так і в сучасних мовах. `),
                sentence(`І зараз я поясню чому. `),
            ]),
        ]),
        /**
         * Якось до Конфуція в гості завітала дуже освідчена пані і спитала:
         *  - Поясність мені, мудрецю, чому коли у жінки багато коханців, то її цькують, а коли у чоловіка багато коханок, то його поважають?
         * Перш ніж відповісти Конфуцій завантажив термінал і почав набирати код на С++.
         *  - Скажи, - спитав він здивовану гостю, - коли функція приймає багато значень, це нормально?
         *  - Так, - відповіла жінка.
         *  - А коли функція повертає багато значень?
         *  - Теж нормально. Я ж пишу на пітоні.
         * Конфуцій розлютився і викрикнув:
         *  - Дурепа! Таку притчу зіпсувала!
         */
        section(`Про що взагалі мова?`, ...[
            paragraph(...[
                sentence(`Для прикладу візьмемо С++. `),
                sentence(`Функції у цій мові можуть приймати довільну кількість значень, але повертають завжди не більше одного. `),
                sentence(`Ще цікаво те, що у випадку з аргументами зовсім не обов'язково вказувати їх відсутність. `),
                sentence(`Тобто це можливо зробити, використовуючи зарезервоване слово void, а можна і пропустити. `),
                sentence(`А от з результатом так не вийде: він або є, або він void. `),
            ]),
            paragraph(...[
                sentence(`В середовищі С++ існує принаймні два поширених підходи для вирішення цієї проблеми. `),
                sentence(`Перший - це повертати з функції структуру з потрібною кількістю значень. `),
                sentence(`Це може бути, наприклад, std::tuple. `),
                sentence(`Другий підхід - використовувати так звані out-аргументи. `),
                sentence(`При цьому, до моменту виклику функції оголошується потрібна кількість змінних, а під час виклику їх адреси передаються в функцію як звичайні аргументи. `),
                sentence(`Під час своєї роботи функція змінює значення цих змінних, або навіть ініціалізує їх і після її виконання до цих "результатів" можна звернутись ззовні. `),
                sentence(`Дивовижно, чи не так? `),
            ]),
            paragraph(...[
                sentence(`Але чому все склалось саме так? `),
                sentence(`Чому тоді "надлишкові" аргументи не передають в функцію за допомогою std::tuple? `),
                sentence(`Чому під один результат не створюють змінну та не передають її адресу в функцію? `),
                sentence(`Чому у функції не повинно бути рівно-одне вхідне значення і рівно одне-вихідне? `),
                sentence(`Можливо і вихідне значення не потрібне? `),
                sentence(`Чому б не обійтись лише одним-єдиним аргументом-структурою, який буде містити в собі і аргументи, і поля для результатів? `),
                sentence(`А можливо і це зайве, адже ж є глобальний стек... `),
                sentence(`Якщо всі дії виконувати через нього, то можна взагалі викликати функції без будь-яких аргументів чи результатів. `),
            ]),
        ]),
        section(paragraph(`Сектанти. `, `Сектанти everywhere. `), ...[
            paragraph(...[
                sentence(``),
                sentence(``),
                sentence(``),
            ]),
        ]),
        section(``, ...[
            paragraph(...[
                sentence(``),
            ]),
        ]),
    ),
});
