import { illustration, paragraph, sentence, link, section, article, note, list, ref, fig, neg, kw, cm, cpp, c, f, v, lt, js, emp, code, cs } from "../classes/shortcuts";

const note_attributes = note(`Мається на увазі те, що усі вершини об'єкта повинні володіти одними й тими ж властивостями, при цьому значення цих властивостей можуть відрізнятись. `, `Наприклад, властивість "колір" не може бути надана лише частині вершин об'єкту, нею можуть володіти або всі вершини, або жодної. `, `При цьому можлива ситуація, коли всі вершини об'єкту мають властивість "колір", але для частини вершин вона рівна нулю. `)
const note_gpu = note(`Графічний прискорювач - лише одна з популярних і часто вживаних назв. `, `Також можна зустріти терміни графічний процесор, відеоадаптер або GPU - Graphics Processing Unit. `)
const z_order = ``

export default article([ `Програмування комп'ютерної графіки. `, `Вступ. ` ], ...[
    section(`Завдання комп'ютерної графіки.`, ...[
        paragraph(...[
            sentence(`Основним завданням комп'ютерної графіки є побудова зображень з використанням обчислювальної техніки. `),
            sentence(`Існує безліч способів зробити це, тому при виборі конкретного підходу керуються насамперед вимогами до зображення, які бувають дуже різними. `),
            sentence(`Наприклад, графіка в комп'ютерних іграх може мати значно нижчу якість ніж в кінематографі, але при цьому для ігрового сектору важлива стабільність кадрів і швидкодія. `),
            sentence(`На противагу цьому, в кінематографі один кадр може будуватись кілька годин і це повністю прийнятно, адже головним критерієм є якість картинки. `),
            sentence(`Найбільш поширеними критеріями є вже згадані раніше якість зображення та швидкодія але існують й інші. `),
            sentence(`Деколи важлива переносимість обраного підходу на інші платформи, деколи важливо, щоб зображення виглядало гарно, але не дуже важлива його коректність, а деколи існують обмеження на обсяг пам'яті чи ємність батареї. `),
            sentence(``),
        ]),
        paragraph(...[
            sentence(`Набір вимог який висувається до кінцевого зображення а також історичний спадок розвитку обчислювальної техніки формують основу для того, як з графікою працюють сьогодні. `),
            sentence(`Основними і найпопулярнішими ідеями які визначають напрямок індустрії є:`),
        ]),
        list(...[
            [
                sentence(`Зображення виводиться на прямокутний екран який складається з квадратних пікселів, кожен з яких заповнений суцільним кольором. `),
                sentence(`При цьому, будь яка ілюзія руху досягається зміною кадрів. `),
                sentence(`Різні екрани відрізняються різною кількістю пікселів, максимальною частотою кадрів, глибиною кольору та іншим. `),
            ],
            [
                sentence(`Графічні об'єкти що виводяться на екран представлені у вигляді набору багатокутників (найчастіше трикутників). `),
                sentence(`Багатокутники формуються з вершин, а вони, в свою чергу, описуються набором властивостей спільних для усього об'єкту`, note_attributes, `. `),
                sentence(`Основне призначення багатокутників - опис форми об'єкту, його контурів. `),
            ],
            [
                sentence(`Для деталізації об'єктів, опису їх поверхні і рельєфу використовуються текстури. `),
                sentence(`Текстури розділяють на 1-, 2- та 3-вимірні а також кубічні текстури. `),
                sentence(`Вони представлені у вигляді набору форматованих даних (наприклад, колір) розбитих на текселі, канали та шари. `),
            ],
            [
                sentence(`Виводом графіки займається графічний прискорювач`, note_gpu, `. `),
                sentence(`Його архітектура спроектована таким чином, щоб дозволяти йому ефективно працювати над завданнями пов'язаними з графічними обчисленнями. `),
                sentence(`Зокрема, до цього можна віднести як паралельний спосіб обробки даних так і спосіб зберігання та звернення до них. `),
            ],
            [
                sentence(`Для програмування графічних операцій використовують графічні інтерфейси. `),
                sentence(`Вони виступають проміжною ланкою між програмою якій необхідно побудувати зображення та апаратним забезпеченням (графічним прискорювачем), яке це зображення безпосередньо будує. `),
                sentence(`Графічні інтерфейси надають доступ до апаратних ресурсів за допомогою набору абстракцій. `),
                sentence(`Ці абстракції дозволяють до певної міри з однієї сторони не залежати від деталей апаратної реалізації графічних обчислень, а з іншої сторони дозволяють апаратній частині виконувати ці обчислення ефективно. `),
            ],
        ]),
    ]),
    section(`Особливості роботи з комп'ютерною графікою. `, ...[
        paragraph(...[
            sentence(`Робота з графікою наповнена великою кількістю особливостей, які не дуже часто зустрічаються в інших областях. `),
            sentence(`В першу чергу сюди можна віднести особливості пов'язані з алгоритмами і структурами даних. `),
            sentence(`Наприклад, через паралельну природу графічного прискорювача не всі алгоритми сортування будуть працювати на ньому настільки ж ефективно, як і на центральному процесорі. `),
            sentence(`З іншого боку, через особливості графічного конвеєра та виводу графіки в цілому, можуть використовуватись деякі нестандартні структури для зберігання даних, зокрема `, link(`Z-порядок`, z_order), `. `),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
    ]),
    section(``, ...[
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
    ]),
])
