import React from 'react'
import { illustration, paragraph, sentence, link, section, article, note, list, ref, fig, neg, kw, cm, cpp, c, f, v, lt, js, emp, code, cs } from "../classes/shortcuts";

const dpi = `https://uk.wikipedia.org/wiki/Dots_per_inch`
const phi = `https://uk.wikipedia.org/wiki/%D0%A4%D1%96-%D1%84%D0%B5%D0%BD%D0%BE%D0%BC%D0%B5%D0%BD`
const beta = `https://en.wikipedia.org/wiki/Beta_movement`
const hz = `https://uk.wikipedia.org/wiki/%D0%93%D0%B5%D1%80%D1%86`

const i = fig(`i`)
const p = fig(`p`)

const note_aspect = note(`Воно не випадкове і частково пов'язане з відношеннями сторін, які використовують в кіно. `, `Останнє ж, в свою чергу, частково опирається на особливості людського зору. `)
const note_rectangle = note(sentence(`Хоча бувають і квадратні екрани, все ж зазвичай відношення їх сторін складає 16:9 або, хоча б 4:3 `, note_aspect, `. `))
const note_half_pixel = note('Мається на увазі те, що навряд чи ви коли-небудь будете мати справу з ', fig('половиною пікселя'), ' або будь-якою їх дробовою кількістю. ')
const note_pixel_order = note('Вибір напрямку зверху-вниз замість знизу-вверх теж має пояснення: такий напрямок пов\'язаний зі стилем запису/читання тексту в більшості європейських та західних країн. ', 'Першими вважаються речення та літери записані вище та лівіше. ', 'А оскільки перші кроки графіки були сильно пов\'язані з виводом саме тексту, то такий підхід до вибору системи координат зберігся й досі. ')
const note_resolution_aspect = note(sentence('До того ж, не всі екрани вміють однаково працювати з ', fig('не рідними'), ' роздільними здатностями. '), 'Якщо при зміні співвідношення сторін одні екрани можуть просто виводити чорні смуги в мертвих зонах, то інші будуть розтягувати зображення вздовж певної вісі. ')
const note_15hz = note(`Але це пов'язано не стільки з комфортністю сприйняття скільки з високою вартістю виготовлення окремих кадрів, які часто виконуються вручну. `)
const note_60hz = note(`Вища частота відрізняє їх від телевізорів, адже монітори використовуються для роботи і за нижчої частоти очі будуть набагато швидше втомлюватись. `)
const note_led = note(`Тому ми нормально сприймаємо усілякі попереджувальні спалахи і мерехтіння на різноманітних пристроях, які можуть тривати лише десяток мілісекунд. `)

class ScreenResolutions extends React.Component {
    public render() {
        class Resolution {
            readonly name : string
            readonly width : number
            readonly height : number

            public constructor({ name, width, height } : { name : string, width : number, height : number }) {
                this.name   = name
                this.width  = width
                this.height = height
            }

            public get pixels() {
                return this.width * this.height
            }
        }

        const resolutions = [
            {
                name   : 'VGA',
                width  : 640,
                height : 480,
            },
            {
                name   : 'FullHD',
                width  : 1920,
                height : 1080,
            },
            {
                name   : `QHD`,
                width  : 2560,
                height : 1440,
            },
        ].map(x => new Resolution(x))

        const max_width = Math.max(...resolutions.map(({ width }) => width))
        const max_height = Math.max(...resolutions.map(({ height }) => height))
        const border = Math.min(max_width, max_height) * 0.01
        const width = max_width
        const height = max_height

        return (
            <svg width='600px' viewBox={`${-border} ${-border} ${width + border*2} ${height + border*2}`} style={{ backgroundColor : `blue` }}>
                {
                    resolutions
                        .sort((a, b) => b.pixels - a.pixels)
                        .map(({ name, width, height }, index) =>
                            <>
                                <rect
                                    key={index}
                                    x={-border/2}
                                    y={-border/2}
                                    width={width + border}
                                    height={height + border}
                                    style={{
                                        fill : 'red',
                                        stroke : 'black',
                                        strokeWidth : border,
                                    }}
                                />
                                <text
                                    x={width}
                                    y={height}
                                    style={{
                                        dominantBaseline : 'text-after-edge',
                                        textAnchor : 'end',
                                        fontSize : '100pt',
                                    }}
                                >
                                    {name}
                                </text>
                                <text
                                    x={width/2}
                                    y={height}
                                    style={{
                                        dominantBaseline : 'text-after-edge',
                                        textAnchor : 'middle',
                                        fontSize : '50pt',
                                    }}
                                >
                                    {width}
                                </text>
                            </>
                        )
                }
            </svg>
        )
    }
}

export default article([ `Програмування комп'ютерної графіки. `, `Екран та пікселі. ` ], {}, ...[
    section(`Екран. `, ...[
        paragraph(...[
            sentence(`Після того як зображення побудоване настає час вивести його на екран. `),
            sentence(`Це може бути екран монітора, телевізора, телефону або навіть екран кінотеатру, на який падає світло проектора. `),
            sentence(`І не зважаючи на те, що навіть всередині кожної з приведених категорій окремі екрани можуть суттєво відрізнятись як конструкцією так і принципами роботи, в середовищі графіки з ними все ж працюють більш-менш однаково. `),
            sentence(`Це досягається завдяки певному рівню абстракції: домовленості щодо того, як саме ми можемо працювати з апаратним забезпеченням. `),
            sentence(`Тому починаючи з цього моменту завжди варто вказувати, про які саме екрани ми говоримо: реальні чи віртуальні. `),
        ]),
        paragraph(...[
            sentence(`Віртуальний екран є прямокутною`, note_rectangle, ` регулярною сіткою, що складається з квадратних пікселів. `),
            sentence(`Всі пікселі на сітці екрану однаково вирівняні, їх кількість по горизонталі, вертикалі і в сумі завжди є цілою`, note_half_pixel, ` і всі вони займають однакову площу. `),
            sentence(`Зазвичай пікселі прийнято перелічувати зліва-направо та зверху-вниз`, note_pixel_order, `, користуючись або парою індексів для кожної з координат, або, рідше, єдиним індексом для кожного окремого пікселя. `),
            sentence(`Важливо, що на відміну від `, fig(`віртуальних`), ` пікселів, `, fig(`реальні`), ` не завжди можуть бути розташовані регулярною сіткою, однаково вирівняні, мати квадратну форму чи навіть бути заповнені суцільним кольором. `),
            sentence(`Їх кількість теж може відрізнятись від кількості віртуальних пікселів і це сильно залежить від того, які принципи роботи лежать в основі конкретного монітора. `),
        ]),
        paragraph(...[
            sentence(`Загальна кількість пікселів на екрані є його роздільною здатністю і однією з найважливіших характеристик. `),
            sentence(`Багато популярних роздільних здатностей мають свої власні назви. `),
            sentence(`Наприклад, роздільна здатність VGA становить 640 пікселів по горизонталі та 480 по вертикалі. `),
            sentence(`Ще одним прикладом є найпопулярніша сьогодні роздільна здатність FullHD, сторони якої складаються з 1920 і 1080 пікселів відповідно. `),
            sentence(`Деколи говорячи про FullHD її можуть називати 1080p або 1080i, а, наприклад, QHD зі сторонами 2560 і 1440 пікселів - 1440p. `),
            sentence(`Це частково пов'язано зі стандартами роздільних здатностей для телевізійних сигналів, де закінчення `, i, ` та `, p, ` вказують на характер передачі даних про окремий кадр. `),
            // @todo: перевірити
            sentence(`У випадку, якщо кадр передається двома порціями, кожна з яких містить рядки що попарно чергуються, використовується закінчення `, i, ` - interlaced (англ. "переплетений", чергування рядків), а у випадку повної передачі за один раз - `, p, ` - progressive (англ. передовий, без чергування рядків). `),
            sentence(`Для віртуальних екранів зазвичай це немає жодного значення, оскільки в більшості випадків при виводі на віртуальний екран передається уся інформація про кадр. `),
        ]),
        paragraph(...[
            sentence(`Ще одним важливим чинником для сприйняття є розмір реального екрану та відстань з якої його спостерігають. `),
            sentence(`Оскільки кожен піксель може бути заповнений лише одним суцільним кольором, недостатня їх кількість може зробити зображення зернистим. `),
            sentence(`Також зернистість може з'являтись навіть якщо розглядати екран з високою роздільною здатністю але з близької відстані. `),
            sentence(`Тому при роботі з графікою важливо слідкувати за реальними розмірами поверхні на якій зображується картинка. `),
            sentence(`Найкращою характеристикою в цьому плані є `, link(`DPI`, dpi), ` (dots per inch) - відношення, яке говорить про те, скільки точок/пікселів міститься на певній площі. `),
            sentence(`Ну і наостанок не варто забувати, що роздільна здатність може змінюватись. `),
            sentence(`Більшість екранів сьогодні підтримує величезну кількість роздільних здатностей які, до того ж, можуть відрізнятись співвідношеннями сторін`, note_resolution_aspect, `. `),
            sentence(`Тому навіть один і той же екран за різних роздільних здатностей буде мати різну зернистість. `),
        ]),
    ]),
    section(`Частота. `, ...[
        paragraph(...[
            sentence(`Не менш важливою характеристикою екрану - як реального так і віртуального - є його частота оновлення. `),
            sentence(`Справа в тому, що виводячи якийсь об'єкт на екран ми усього лише зафарбовуємо певну частину його пікселів в певний колір. `),
            sentence(`Сам об'єкт не знаходиться на екрані, тому ми не можемо зсунути чи повернути його, якщо нам потрібно показати рух. `),
            sentence(`Ми також не можемо зсунути пікселі: лише перефарбувати їх. `),
            sentence(`Тому будь яка ілюзія руху на екрані досягається банальною зміною картинки. `),
            sentence(`І якщо робити це достатньо швидко то нам буде здаватись що об'єкт рухається, хоча насправді його там і немає. `),
            sentence(`Такий трюк можливий завдяки особливостям людського сприйняття, зокрема `, link(`φ-феномену`, phi), ` та `, link(`β-руху`, beta), `. `),
        ]),
        paragraph(...[
            sentence(`Частота оновлення екрану - це кількість кадрів які він здатен змінити за одну секунду. `),
            sentence(`Зазвичай цю величину вимірюють в `, link(`герцах`, hz), ` або використовують абревіатуру FPS - Frames Per Seconds (карди за секунду). `),
            sentence(`Що вищий цей показник тим плавнішим буде рух. `),
            sentence(`Нижня межа, нижче якої рух стає важко сприймати знаходиться на рівні 10-15 кадрів за секунду і зазвичай застосовується в анімації`, note_15hz, `. `),
            sentence(`Якщо ж мова заходить про динамічні сцени на які треба вчасно реагувати - наприклад, сцени в іграх - то цієї частоти не вистачає і планка піднімається до 30 Гц. `),
            sentence(`На такій частоті працює більшість телевізійного обладнання (особливо старого) а також ігрові консолі які під нього заточені. `),
        ]),
        paragraph(...[
            sentence(`Якщо мова заходить про роботу з текстом або дрібними графічними елементами то більш прийнятними є 60 Гц які є нижньою межею для більшості комп'ютерних моніторів`, note_60hz, `. `),
            sentence(`Чіткої верхньої межі сприйняття як такої не існує: хоча більшість людей не здатні, наприклад, правильно розпізнати дуже швидкий текст, вони все ж можуть помітити саму його появу`, note_led, `. `),
            sentence(`Сучасні ж ігрові монітори розраховані на частоти в діапазоні від 100 до 300 Гц, що вносить свій вклад у сприйняття динамічних сцен в таких жанрах як гонки або стрілялки. `),
        ]),
        paragraph(...[
            sentence(`Не менш важливою але менш відомою є ще одна характеристика - швидкість відгуку. `),
            sentence(`Це час, який потрібен пікселю щоб змінити свою яскравість. `),
            sentence(`Його можуть вимірювати по різному, але зазвичай це час зміни кольору пікселя від чорного до білого, від чорного до білого і знову до чорного, від чорного до сірого і т.і. `),
            sentence(`Швидкість відгуку важлива, тому що при зміні кадрів колір пікселів змінюється не миттєво і якщо це триває досить довго, то зображення може стати нечітким. `),
            sentence(`Замість того аби сприймати колір кадру протягом усього часу його виведення, якийсь час спостерігач буде бачити процес переходу пікселів в новий стан. `),
            sentence(`Для особливо повільних екранів це може створювати досить помітні силуети, що тягнуться за рухомими об'єктами. `),
        ]),
        paragraph(...[
            sentence(`Затримка вводу, V-Sync, G-Sync/FreeSync. `),
            sentence(``),
        ]),
    ]),
    section(`Глибина кольору. `, ...[
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
    ]),
    section(``, ...[
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
    ]),
])
