import { article, c, cm, code, cs, emp, f, fig, illustration, js, jsx, kw, link, lt, neg, note, paragraph, py, quote, section, sentence, v, l0, cpp, lts, comparison, ts, tex } from '../classes/shortcuts'
import CosineLaw from './lambertian-reflectance/cosine-law'

const brdf = `https://uk.wikipedia.org/wiki/%D0%94%D0%B2%D0%BE%D0%BF%D1%80%D0%BE%D0%BC%D0%B5%D0%BD%D0%B5%D0%B2%D0%B0_%D1%84%D1%83%D0%BD%D0%BA%D1%86%D1%96%D1%8F_%D0%B2%D1%96%D0%B4%D0%B1%D0%B8%D0%B2%D0%BD%D0%BE%D1%97_%D0%B7%D0%B4%D0%B0%D1%82%D0%BD%D0%BE%D1%81%D1%82%D1%96`
const lambert = `https://uk.wikipedia.org/wiki/%D0%9B%D0%B0%D0%BC%D0%B1%D0%B5%D1%80%D1%82%D0%BE%D0%B2%D0%B5_%D0%B2%D1%96%D0%B4%D0%B1%D0%B8%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F`

const r = String.raw

export default  article(`Закон косинуса Ламберта.`, {}, ...[
    section(``, ...[
        paragraph(...[
            sentence(`Закон косинуса Ламберта встановлює обмеження на те, яку кількість енергії поверхня може отримати від джерела прямого світла. `),
            sentence(`Він стверджує, що ця кількість є пропорційною до кута під яким світло падає на поверхню, а якщо бути точнішим - то до косинуса цього кута. `),
            sentence(`Оскільки в загальному випадку поверхня не може випромінювати більше світла ніж отримує, закон косинуса є важливим при розрахунку освітлення. `),
            sentence(`Він використовується в якості одного з головних чинників в багатьох формулах та моделях: зокрема, в `, link(`двосторонній функції відбивальної здатності`, brdf), ` та в `, link(`моделі освітлення Ламберта`, lambert), `. `),
        ]),
    ]),
    section(`Умовні позначення. `, ...[
        paragraph(...[
            sentence(`Перш за все варто зауважити, що правило косинуса працює лише для прямого світла. `),
            sentence(`Це означає, що у будь якій точці простору випромінювання повинно поширюватись в одному напрямку, що `, emp(`не`), ` виконується для більшості звичних нам джерел світла. `),
            sentence(`Наприклад, лампи розжарювання в більшій мірі є точковими джерелами і випромінюють у всі сторони: два сусідні промені матимуть дещо різний напрямок і з часом будуть віддалятись один від одного. `),
            sentence(`Джерела на кшталт екранів теж не є прямими, адже кожен їхній піксель випромінює подібно до точкового джерела. `),
        ]),
        paragraph(...[
            sentence(`Близькими то прямих джерел є лазери, проектори та сонячне світло. `),
            sentence(`У випадку лазерів саме випромінювання отримується у відмінний від розжарювання спосіб, що окрім усього іншого забезпечує й майже однаковий напрямок для сусідніх променів. `),
            sentence(`Сонце ж, навіть будучи сферичним джерелом, на побутовому рівні настільки віддалене від нас, що два сусідні промені мають майже однаковий напрямок. `),
            sentence(`Але у випадку Сонця подібні спрощення відносно добре працюють або на дрібних масштабах, або на великих відстанях. `),
        ]),
        paragraph(...[
            sentence(`Говорячи про кут під яким світло падає на поверхню ми будемо відштовхуватись від двох напрямків, заданих векторами. `),
            sentence(`Вектор `, tex(r`\vec{l}`), ` буде вказувати напрямок на джерело світла, який у випадку прямого світла є оберненим до напрямку випромінювання. `),
            sentence(`Якщо промені рухаються в напрямку `, tex(r`\{ 1, 3, -2 \}`), `, то напрямком на джерело буде вектор `, tex(r`\vec{l}`), ` рівний `, tex(r`\{ -1, -3, 2 \}`), `. `),
            sentence(`Вектор `, tex(r`\vec{n}`), `, який ми будемо називати нормаллю, вказуватиме в яку сторону повернута поверхня. `),
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
    ]),
    section(`Природа ефекту. `, ...[
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
        illustration(``, CosineLaw),
    ]),
    section(``, ...[
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
    ]),
])
