import { illustration, paragraph, sentence, link, section, article, note, list, ref, fig, neg, kw, cm, cpp, c, f, v, lt, js, emp, code, cs, tex } from "../classes/shortcuts"
import CosineLaw from "./lambertian-reflectance/cosine-law"
import ReflectionDiffusion from "./lambertian-reflectance/reflection-diffusion"
import DirectAndReflectedLight from "./lambertian-reflectance/direct-and-reflected-light"
import MicroSurface from "./lambertian-reflectance/micro-surface"
import Hemisphere from "./lambertian-reflectance/hemisphere"

const r = String.raw
const model = `https://uk.wikipedia.org/wiki/%D0%9B%D0%B0%D0%BC%D0%B1%D0%B5%D1%80%D1%82%D0%BE%D0%B2%D0%B5_%D0%B2%D1%96%D0%B4%D0%B1%D0%B8%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F`
const johann = `https://uk.wikipedia.org/wiki/%D0%99%D0%BE%D0%B3%D0%B0%D0%BD%D0%BD_%D0%93%D0%B5%D0%BD%D1%80%D1%96%D1%85_%D0%9B%D0%B0%D0%BC%D0%B1%D0%B5%D1%80%D1%82`
const photometria = `https://en.wikipedia.org/wiki/Photometria`
const spectralon = `https://en.wikipedia.org/wiki/Spectralon`
const age = (() => {
    const ms = (new Date).valueOf() - new Date('1760').valueOf()
    const y = (ms / (1000 * 60 * 60 * 24 * 365)).toFixed(0)
    const l = Number(y[y.length - 1])
    const end =
        l === 1 ? 'рік'   :
        l < 4   ? 'роки'  :
        'років'

    return `${y} ${end}`
})()
const oren_nayar = `https://en.wikipedia.org/wiki/Oren%E2%80%93Nayar_reflectance_model`
const cook_torrance = `https://en.wikipedia.org/wiki/Specular_highlight#Cook%E2%80%93Torrance_model`
const steradian = `https://uk.wikipedia.org/wiki/%D0%A1%D1%82%D0%B5%D1%80%D0%B0%D0%B4%D1%96%D0%B0%D0%BD`
const dot = `https://uk.wikipedia.org/wiki/%D0%A1%D0%BA%D0%B0%D0%BB%D1%8F%D1%80%D0%BD%D0%B8%D0%B9_%D0%B4%D0%BE%D0%B1%D1%83%D1%82%D0%BE%D0%BA`
const Om = tex(r`\Omega`)
const om = tex(r`\omega`)
const om_ = tex(r`\vec{\omega}`)
const n = tex(r`\vec{n}`)

const reflection_diffusion = illustration('', ReflectionDiffusion)
const cosine_law = illustration('', CosineLaw)

export default article([ `Модель освітлення Ламберта.` ], {}, ...[
    section(`Що таке модель відбиття Ламберта? `, ...[
        paragraph(...[
            sentence(link(`Модель відбиття`, model), ` `, link(`Ламберта`, johann), ` була оприлюднена 1760-го року в його ж книзі `, link(`Photometria`, photometria), `. `),
            sentence(`Вона описує взаємодію шорстких поверхонь зі світлом: скільки світла і в якому напрямку вони відбивають. `),
            sentence(`Ця модель найточніше підходить для матеріалів, що добре розсіюють світло і яскравість яких не залежить від нахилу відносно спостерігача. `),
            sentence(`Зокрема, такими є папір, гіпс, необроблене дерево та `, link(`спектралон`, spectralon), `. `),
            sentence(`Не зважаючи на те що модель Ламберта була сформована ${age} тому, вона й досі знаходить своє застосування в областях комп'ютерної графіки та комп'ютерного зору. `),
            sentence(``),
        ]),
    ]),
    section(`Розсіювання світла. `, ...[
        paragraph(...[
            sentence(`В основі моделі Ламберта лежать дві прості ідеї: розсіювання світла та залежність його інтенсивності від кута падіння. `),
            sentence(`На противагу дзеркальній моделі, за якої світловий потік відбивається під тим же кутом, під яким і падає, модель Ламберта передбачає ідеальне розсіювання (див. `, reflection_diffusion, `). `),
            sentence(`Весь світловий потік що потрапляє на поверхню рівномірно розсіюється у всіх можливих напрямках. `),
            sentence(`Тому з будь якої точки огляду поверхня буде виглядати однаково, на відміну від того ж дзеркала, зображення на якому буде змінюватись разом з ракурсом. `),
        ]),
        // @todo: додати дуги кутів?
        // @todo: додати анімацію падіння променів?
        // @todo: додати промені-хвилі?
        reflection_diffusion,
        paragraph(...[
            sentence(`Такий характер розсіювання світла можна пояснити формою поверхні на мікроскопічному рівні. `),
            sentence(`Деякі більш пізні моделі, такі як модель `, link(`Орена-Наяра`, oren_nayar), ` або `, link(`Кука-Торенса`, cook_torrance), ` інтерпретують макроскопічну поверхню як набір мікроскопічних граней. `),
            sentence(`Кожна така грань може мати власну орієнтацію і вносити свій вклад в освітлення навіть залишаючись невидимою для неозброєного ока. `),
            sentence(`Можна вважати, що у випадку моделі Ламберта грані орієнтовані випадковим чином, причому їх напрямки розподілені рівномірно. `),
            sentence(`Кожна така грань може відбивати світло як дзеркало, але за рахунок рівномірного розподілу світловий потік врешті буде розсіяний у всіх напрямках. `),
        ]),
        // @todo: додати анімацію падіння променів?
        // @todo: додати промені-хвилі?
        illustration(``, MicroSurface),
        paragraph(...[
            sentence(`Що можна розуміти під `, fig(`усіма напрямками`), ` в даному випадку? `),
            sentence(`Модель відбиття Ламберта не передбачає ні падіння світла з-під поверхні, ні його відбиття під поверхню. `),
            sentence(`Таким чином, множина всіх можливих напрямків обмежується одиничною півсферою `, Om, ` над поверхнею і її площею, яка становить `, tex(r`2\pi`), ` `, link(`стерадіан`, steradian), ` (далі ср). `),
            sentence(`Якщо вважати, що сума усього світла з усіх напрямків `, Om, ` рівна `, tex(r`E_{\Omega}`), `, то сума світла яку можна буде спостерігати під тілесним кутом з площею `, om, ` повинна бути рівна `, tex(r`E_{\Omega} \dfrac{\omega}{\Omega}`), ` або `, tex(r`E_{\Omega} \dfrac{\omega}{2\pi}`), `. `),
            // sentence(`Як можна побачити, поки що ця величина не залежить від кута під яким спостерігається поверхня. `),
        ]),
        // @todo: додати ілюстрацію з тілесними кутами
        illustration('', Hemisphere),
    ]),
    section(`Правило косинуса. `, ...[
        paragraph(...[
            sentence(`Друга ідея полягає в тому, що зі збільшенням кута між світлом та поверхнею зменшується його інтенсивність. `),
            sentence(`Це пов'язане з тим, що при нахилі поверхні до спостерігача зменшується загальна область яку вона займає в полі зору. `),
            sentence(`Якщо під прямим кутом була видима деяка площа поверхні, то зі збільшенням кута загальна площа огляду для спостерігача буде залишатись сталою, але відносна площа поверхні буде прямувати до нуля. `),
            sentence(`Таким чином, хоч спостерігач зможе охопити поглядом більшу територію, частка яку займає конкретна поверхня на загальній площі буде зменшуватись. `),
        ]),
        // @todo: додати ілюстрацію з косинусом
        paragraph(...[
            sentence(`Видима кількість поверхні пропорційна косинусу кута між напрямком погляду та перпендикуляром до цієї поверхні - нормаллю. `),
            sentence(`Якщо напрямок під яким спостерігають поверхню позначити `, om_, ` а нормаль `, n, `, то спостережувана площа буде пропорційна до `, tex(r`cos(\widehat{\vec{\omega} \vec{n}})`), `, де `, tex(r`\widehat{\vec{\omega} \vec{n}}`), ` це кут між вказаними векторами. `),
            sentence(`Як відомо, косинус кута між двома нормалізованими векторами (тобто такими, що їхня довжина рівна одиниці) рівний `, link(`скалярному добутку`, dot), ` цих векторів. `),
            sentence(`Тому у випадку нормалізованих `, om_, ` та `, n, ` шукана площа пропорційна `, tex(r`\vec{\omega} \cdotp \vec{n}`), `, де `, tex(r`\cdotp`), ` позначає скалярний добуток. `),
            sentence(`В загальному ж випадку - для не нормалізованих векторів - площа пропорційна до `, tex(r`\dfrac{ \vec{\omega} \cdotp \vec{n} }{ |\vec{\omega}| |\vec{n}| }`), `. `),
        ]),
        paragraph(...[
            sentence(`Важливо розуміти яким чином в рівнянні з'являється косинус кута. `),
            sentence(`При зміні нахилу поверхні відносно спостерігача насправді не важливо хто обертається: поверхня чи спостерігач навколо неї (див. `, /* cosine_law, */ `). `),
            sentence(`Відповідно, достатньо знайти формулу яка б описувала площину що обертається в полі зору камери. `),
            sentence(`Оскільки при повороті відстані між вершинами об'єкту не змінюються ми можемо описати краї площини як протилежні точки на одиничному колі. `),
            sentence(`Самі ж точки на колі описуються синусом і косинусом кута а вибір між ними залежить від того відносно чого ми вимірюємо кути. `),
            sentence(`Ми використовуватимемо косинус тому, що для нульового кута він буде давати максимальне значення - одиницю, а для кута 90° - нуль. `),
        ]),
        cosine_law,
        // @todo: sin/cos
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
        illustration('', tex(r`
            I = \partial\omega_o \dfrac{ \partial \omega_i }{ \Omega }
        `)),
    ]),
    section(``, ...[
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
        ]),
    ]),
])
