import { article, illustration, paragraph, section, sentence, tex, } from "../classes/shortcuts";
import Intersection from './lines-intersection/intersection'

const r = String.raw
const ab = tex(r`\vec{ab}`)
const uv = tex(r`\vec{uv}`)
const x = tex(r`\vec{x}`)

export default article(`Знаходження точки перетину прямих. `, ...[
    section(`Навіщо це потрібно? `, ...[
        paragraph(...[
            sentence(`Навіть при написанні дуже простої гри на кшталт пінг-понгу може виникнути потреба в математиці, яку ми не звикли використовувати в повсякденному житті - лінійній алгебрі. `),
            sentence(`Зокрема, це може знадобитись для того аби обчислити точне місце зіткнення м'яча з ракеткою або межами ігрового поля. `),
            sentence(`І це відносно легко зробити якщо представити м'яч у вигляді точки що рухається по прямій а поверхню з якої він зіштовхується - у вигляді прямої обмеженої двома точками. `),
        ]),
    ]),
    section(`Представлення. `, ...[
        paragraph(...[
            sentence(`Обчислення які ми будемо проводити залежать від розмірності простору, адже дві прямі можуть перетинатись як в двовимірному просторі, так і в тривимірному або й навіть в просторах більшої розмірності. `),
            sentence(`Але навіщо обмежувати себе якоюсь певною розмірністю, якщо можна вирішити завдання для довільного випадку? `),
            sentence(`Тому наші обчислення не будуть залежати від розмірності простору. `),
            sentence(`Але варто зауважити, що для перетину дві прямі повинні лежати в одній площині, що, по-перше, дуже малоймовірно для довільних прямих та по-друге має свої обмеження при обчисленнях з використанням чисел з плавучою комою. `),
        ]),
        paragraph(...[
            sentence(`Траєкторією руху м'яча ми будемо вважати пряму `, ab, `, а перешкодою з якою він буде зіштовхуватися - пряму `, uv, `. `),
            sentence(`Нам потрібно визначити чи ці дві прямі взагалі перетинаються і якщо це так - також точку цього перетину `, x, `. `),
            sentence(`Оскільки `, x, ` може розміщуватись на `, ab, ` в будь якому місці ми запишемо його розташування у вигляді функції `, tex(r`\vec{x} = \vec{a} + t(\vec{b} - \vec{a})`), `, де `, tex(r`t \in [0, 1]`), `. `),
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
            sentence(``),
        ]),
    ]),
    section(``, ...[
        paragraph(...[
            sentence(``),
            sentence(``),
            sentence(``),
        ]),
        illustration('lol kek', Intersection),
    ]),
    section(``, ...[
        paragraph(...[
            sentence(``),
            sentence(``),
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
            sentence(``),
        ]),
    ]),
])
