import Article from "../classes/article";
import Section from "../classes/section";
import Sentences from "../classes/sentences";
import { code, illustration, p, sen } from "../classes/shortcuts";

export default new Article({
    title : new Sentences({ array : [
        sen(`Думки вголос. `),
        sen(`Перевантаження за результатом. `),
    ] }),
    sections : [
        new Section({
            title : new Sentences({ array : [] }),
            parts : [
                p(
                    `Деякі зі статично-типізованих мов програмування підтримують механізм перевантаження функцій1. `,
                    `Це виражається в тому, що під одним іменем можна оголосити декілька функцій, які будуть відрізнятись за кількістю аргументів або типами цих аргументів. `,
                    `Характерною ознакою конкретно такої реалізації є те, що перевантаження ігнорує результат. `,
                    `Наслідком такого підходу є неможливість існування двох функцій з однаковими іменами, які відрізняються лише типом результату (див. Приклад коду №1). `,
                    `Метою цієї сторінки є висловлення ідеї, що подібне обмеження – нісенітниця. `,
                ),
                illustration(`Приклад коду №1`,
                    `Використання перевантажених за результатом функцій в представленні художника. `,
                    code(`C++`,
                        'int   f() {',
                        '    return 1;',
                        '}',
                        'float f() {',
                        '    return 2.0;',
                        '}',
                        '',
                        'int   x = f();',
                        'float y = f();',
                        '',
                        'print(x); // 1',
                        'print(y); // 2',
                    ),
                ),
            ],
        }),
    ],
})
