import React from 'react'
import { article, c, cm, code, cs, emp, f, fig, illustration, js, jsx, kw, link, lt, neg, note, paragraph, py, quote, section, sentence, v, l0, cpp, lts, comparison, ts } from '../classes/shortcuts'

const rahul = note(``)

export default  article([ `Що не так з одинаком? ` ], {}, ...[
    section(`Про що взагалі мова? `, ...[
        paragraph(...[
            sentence(`Одинак є не лише класичним прикладом шаблону проектування, але й постійним нагадуванням про недосконалість сучасних мов. `),
            sentence(`Але хоча не лише я вважаю що з ним не все гаразд, я поки не зустрів нікого іншого, хто звинуватив би в цьому самі мови. `),
            sentence(`Тому, гадаю настав час зафіксувати, що ж я думаю з цього приводу. `),
        ]),
        paragraph(...[
            sentence(`Також, не зважаючи на низку цілком справедливих зауважень в сторону одинака, існують й такі, з якими я зовсім не погоджуюсь. `),
            sentence(`Але обидві ці категорії часто погано аргументовані і спираються на суб'єктивні судження, традицію або авторитет. `),
            sentence(`Я ж постараюсь не вживати рагулізми`, rahul, ` на кшталт запаху коду і буду намагатись пояснити суть проблем які я бачу, з конкретними прикладами та розгорнутим описом їх шкоди. `),
            sentence(`Сподіваюсь це все ж допоможе прояснити, що ж насправді не так з одинаком. `),
        ]),
        paragraph(...[
            sentence(``),
            sentence(``),
            sentence(``),
        ]),
    ]),
    section(``, ...[
        paragraph(...[
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
        ]),
    ]),
    section(``, ...[
        paragraph(...[
            sentence(``),
        ]),
        paragraph(...[
            sentence(``),
        ]),
    ]),
])
