import React from 'react'
import Page from '../components/page'
import Article from '../components/article'
import { article, emp, paragraph, section, sentence } from '../classes/shortcuts'

const model = article('Про це місце...', ...[
    section('Навіщо потрібен цей сайт?', ...[
        paragraph(...[
            'Цей маленький сайт є місцем, де я зберігаю свої ідеї, проекти, а також матеріали якими я хочу поділитись зі світом. ',
            'Він наповнений Українською Мовою, моїм праведним гнівом на сучасне програмування та вільний від шпигування за гостями. ',
            'Насолоджуйтесь! ',
        ]),
    ]),
    section('Чому "Безнадійний Програміст"?',
        paragraph(
            'Сучасні мови сфери IT - повний відстій. ',
            'Вони - безнадійні! ',
            'При всій повазі до довгого шляху який програмування пройшло, величезної кількості вад можна було б уникнути. ',
            'Часто ці вади мають серйозні історичні причини для існування, але ж не можна вічно їх терпіти! ',
        ),
        paragraph(
            'На жаль далеко не кожен розділяє ці мої погляди. ',
            'Багато з тих питань які я піднімаю не сильно обходять людей. ',
            'Їм немає діла до дрібних недоліків, типу перекриття ідентифікаторів, службових слів, чи випереджувального оголошення, а мені є! ',
            'І найгірше те, що часто вони ще й намагаються захищати ці вади! ',
        ),
        paragraph(
            sentence('Мені така ситуація ', emp('вкрай не подобається'), '. '),
            'Я вважаю, що проблеми сучасних мов потрібно вирішувати. ',
            'Можливо колись, коли більшість з піднятих мною питань будуть вирішені - я знайду внутрішній спокій. ',
            'А до того часу - в умовах сьогоднішнього безнадійного програмування і безнадійних мов - я - безнадійний програміст. ',
        ),
    ),
    section('Чому ти створив власний сайт, а не використав нинішні платформи?',
        paragraph(
            'Власне, я не дуже обізнаний в плані сучасних україномовних інформаційних ресурсів що націлені на програмування. ',
            'Також у мене є ціла низка вимог до функціоналу, яким повинен володіти ресурс з моїми публікаціями. ',
            'На власному ж сайті я в будь-який момент можу додати необхідне мені наповнення, будь то інтерактивна діаграма, специфічна підсвітка коду чи вивід графіки. ',
        ),
        paragraph(
            'Але одна з головних причин - це, власне, теми яких я торкаюсь. ',
            'Я доволі рідко бачу статті з концентрованою критикою сучасних мов та підходів. ',
            'А тому вважаю доцільним не засмічувати простори інтернету, а акуратно зібрати все це в спеціально відведеному на це куточку. ',
            'Тут! ',
        ),
        paragraph(
            'Окрім цього, створення сайту це ще й спосіб залишатись в формі. ',
            'Моя поточна робота не багата на таку розкіш як вивчення нових технологій. ',
            'А от власний сайт це чудовий спосіб принаймні познайомитись з сучасними інструментами для роботи з webом. ',
        ),
    ),
])

export default class About extends React.Component {
    public render() {
        return (
            <Page>
                <Article model={model}/>
            </Page>
        )
    }
}
