const s = require(`../../server/documenting`).shortcuts;
const {
    kw,
    f,
    lt,
    c,
    cm,
} = s;

exports = module.exports = s.illustration(`В С++ неможливо записати функцію без вказування типу значення яке вона повертає. `, s.cpp(...[
    [ cm(`// функція без аргументів`) ],
    [ c(`void`), ` `, f(`f`), `(`, c(`void`), `) {` ],
    [ `    `, kw(`return`), `;` ],
    [ `}` ],
    [ `` ],
    [ cm(`// теж функція без аргументів`) ],
    [ c(`void`), ` `, f(`f`), `() {` ],
    [ `    `, kw(`return`), `;` ],
    [ `}` ],
    [ `` ],
    [ cm(`// функція без результату`) ],
    [ c(`void`), ` `, f(`f`), `() {` ],
    [ `    `, kw(`return`), `;` ],
    [ `}` ],
    [ `` ],
    [ cm(`// а ось так вже не вийде`) ],
    [ f(`f`), `() {` ],
    [ `    `, kw(`return`), `;` ],
    [ `}` ],
]));
